In [1]:
import pandas as pd

In [24]:
df = pd.DataFrame(
    {"a" : [4,5,6],
    "b" : [7,8,9],
    "c" : [10,11,12]},
    index=[1,2,3])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [22]:
df2 = pd.DataFrame(
    {"a" : [4,5,6],
    "b" : [7,8,9],
    "c" : [10,11,12]},
   )

In [25]:
df2 # index 지정 안하면 0부터 지정됨

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

In [18]:
df.loc[[1,2], ["a","b"]]

   a  b
1  4  7
2  5  8

### columns name --> dict로 지정할 수도 있고 위처럼 columns라는 인자를 넣을 수도 있다.

In [33]:
df = pd.DataFrame(
    [[4, 7, 10],
    [5, 8, 11],
    [6, 9, 12]],
    index=[1, 2, 3],
    columns=['a', 'b', 'c'])

In [34]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

### multi index를 사용하여 상위 인덱스를 만들 수도 있음
index를 튜블로 지정하여 multi index 지정할 수 있음

In [21]:
df = pd.DataFrame(
    {"a" : [4 ,5, 6],
    "b" : [7, 8, 9],
    "c" : [10, 11, 12]},
    index = pd.MultiIndex.from_tuples(
    [('d',1),('d',2),('e',2)],
    names=['n','v']))
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

## 비교 연산자를 이용해 slicing

In [28]:
df[df.a < 7]

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [29]:
df.b > 7

1    False
2     True
3     True
Name: b, dtype: bool

In [31]:
df[df.b > 7]

   a  b   c
2  5  8  11
3  6  9  12

In [38]:
df[df['c'] >= 6]

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [48]:
df = pd.DataFrame(
    [[4, 7, 10],
    [6,9,12],
    [6, 9, 12]],
    index=[1, 2, 3],
    columns=['a', 'b', 'c'])

In [49]:
df

   a  b   c
1  4  7  10
2  6  9  12
3  6  9  12

In [50]:
df.drop_duplicates() # 중복된 값을 제거

   a  b   c
1  4  7  10
2  6  9  12

In [51]:
df

   a  b   c
1  4  7  10
2  6  9  12
3  6  9  12

In [54]:
df.drop_duplicates(inplace=True) # 권장하지 않음. 원래 데이터프레임을 수정하니까

In [53]:
df

   a  b   c
1  4  7  10
2  6  9  12

In [58]:
df = pd.DataFrame(
    [[4, 7, 10],
    [6,9,12],
    [6, 9, 12]],
    index=[1, 2, 3],
    columns=['a', 'b', 'c'])

df = df.drop_duplicates()

In [59]:
df

   a  b   c
1  4  7  10
2  6  9  12